Revit 2027 API
AssemblyInstance.GetCenter Method
 Returns the center of the bounding box for the assembly instance. This is the default position for placed assembly instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetCenter()
Public Function GetCenter As XYZ
public:
XYZ^ GetCenter()
member GetCenter : unit -> XYZ
Return Value
XYZ
 The position for the center of the assembly instance.
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace